aom
bat
bdw-gc
boost
brotli
buku
ca-certificates
cairo
cjson
cmake
cmocka
coreutils
cowsay
dav1d
docbook
docbook-xsl
duti
exa
exiftool
expat
faad2
fd
ffmpeg
fftw
figlet
flac
fluid-synth
fmt
fontconfig
fortune
freetype
frei0r
fribidi
fzf
gcc
gdbm
gettext
ghostscript
giflib
glib
gmp
gnu-getopt
gnu-sed
gnupg
gnutls
gobject-introspection
grap
graphite2
groff
guile
harfbuzz
htop
hwloc
icu4c
imagemagick
imath
isl
jasper
jbig2dec
jpeg
jpeg-xl
json-c
lame
leptonica
lf
libao
libass
libassuan
libbluray
libde265
libevent
libffi
libgcrypt
libgpg-error
libheif
libid3tag
libidn
libidn2
libksba
liblqr
libmpc
libmpdclient
libnfs
libnghttp2
libogg
libomp
libpng
libpthread-stubs
librist
libsamplerate
libshout
libsndfile
libsodium
libsoxr
libstfl
libtasn1
libtermkey
libtiff
libtool
libunistring
libupnp
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxls
libxlsxwriter
libxml2
libxrender
libyaml
libzip
little-cms2
lua
luajit-openresty
luv
lynx
lzo
m4
make
mas
mbedtls
mpd
mpdecimal
mpfr
msgpack
ncmpcpp
ncurses
neofetch
neovim
netpbm
nettle
newsboat
npth
open-mpi
openblas
opencore-amr
openexr
openjpeg
openssl@1.1
opus
p11-kit
pandoc
pass
pcre
pcre2
pfetch
pinentry
pixman
pkg-config
portaudio
psutils
python@3.10
python@3.9
qrencode
qt@5
r
rav1e
readline
remind
rubberband
ruby
sc-im
screenresolution
sdl2
shared-mime-info
six
smartmontools
snappy
speedtest-cli
speex
sqlite
srt
starship
taglib
tcl-tk
tesseract
theora
trash-cli
tree
tree-sitter
uchardet
unar
unbound
unibilium
webp
wget
wifi-password
x264
x265
xmlto
xorgproto
xpdf
xvid
xz
youtube-dl
zeromq
zimg
zsh-autosuggestions
zsh-syntax-highlighting
zstd
adobe-acrobat-reader
alacritty
amethyst
arduino
brave-browser
cryptomator
eloston-chromium
exifcleaner
firefox
freecad
gimp
hiddenbar
inkscape
keepassxc
keepingyouawake
libreoffice
librewolf
lulu
macfuse
mactex
macvim
microsoft-auto-update
microsoft-excel
microsoft-powerpoint
microsoft-teams
microsoft-word
mpv
netnewswire
onedrive
qutebrowser
rectangle
rstudio
signal
skim
the-unarchiver
thunderbird
utm
veracrypt
vitalsource-bookshelf
vmware-horizon-client
vscodium
whatsapp
zoom
